fixture/vcr_cassettes/billing/plans_create.json

[
  {
    "request": {
      "body": "{\"quantity_supported\":true,\"product_id\":\"PROD-8H491059A5228662S\",\"payment_preferences\":{\"payment_failure_threshold\":3},\"name\":\"Premium Support\",\"description\":\"Premium Support Helpdrive.io\",\"billing_cycles\":[{\"total_cycles\":0,\"tenure_type\":\"REGULAR\",\"sequence\":1,\"pricing_scheme\":{\"fixed_price\":{\"value\":100.0,\"currency_code\":\"USD\"}},\"frequency\":{\"interval_unit\":\"MONTH\",\"interval_count\":1}}]}",
      "headers": {
        "Authorization": "***",
        "Content-Type": "application/json"
      },
      "method": "post",
      "options": [],
      "request_body": "",
      "url": "https://api.sandbox.paypal.com/v1/billing/plans"
    },
    "response": {
      "binary": false,
      "body": "{\"id\":\"P-41178878AH040254KL4WMWGI\",\"product_id\":\"PROD-8H491059A5228662S\",\"name\":\"Premium Support\",\"status\":\"ACTIVE\",\"description\":\"Premium Support Helpdrive.io\",\"usage_type\":\"LICENSED\",\"create_time\":\"2020-08-07T03:31:37Z\",\"links\":[{\"href\":\"https://api.sandbox.paypal.com/v1/billing/plans/P-41178878AH040254KL4WMWGI\",\"rel\":\"self\",\"method\":\"GET\",\"encType\":\"application/json\"},{\"href\":\"https://api.sandbox.paypal.com/v1/billing/plans/P-41178878AH040254KL4WMWGI\",\"rel\":\"edit\",\"method\":\"PATCH\",\"encType\":\"application/json\"},{\"href\":\"https://api.sandbox.paypal.com/v1/billing/plans/P-41178878AH040254KL4WMWGI/deactivate\",\"rel\":\"self\",\"method\":\"POST\",\"encType\":\"application/json\"}]}",
      "headers": {
        "Cache-Control": "max-age=0, no-cache, no-store, must-revalidate",
        "Content-Length": "675",
        "Content-Type": "application/json",
        "Date": "Fri, 07 Aug 2020 03:31:37 GMT",
        "Paypal-Debug-Id": "80fb245200c16"
      },
      "status_code": 201,
      "type": "ok"
    }
  }
]